Dlubal.RFEM5.SurfaceSupportNonlinearityType
Surface support nonlinearity type

Dlubal.RFEM5.SurfaceSupportNonlinearityType.UnknownSurfaceNonlinearityType
Unknown nonlinearity type

Dlubal.RFEM5.SurfaceSupportNonlinearityType.BasicUnidirectionalActionType
Basic unidirectional action

Dlubal.RFEM5.SurfaceSupportNonlinearityType.YieldingFromContactStressType
Yielding from contact stress

Dlubal.RFEM5.SurfaceSupportNonlinearityType.FrictionInPlaneType
Friction in plane